In [13]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
#过滤掉 dropna()
#填充 fillna()

In [8]:
df=DataFrame(data=np.random.randint(0,100,size=(3,3)),columns=list("ABC"))
df

    A   B   C
0  87  35  20
1   0  40  94
2  71  71  87

In [10]:
df.loc[1,'B']=None
df

    A     B   C
0  87  35.0  20
1   0   NaN  94
2  71  71.0  87

In [12]:
df.loc[2,'C']=None
df

    A     B     C
0  87  35.0  20.0
1   0   NaN  94.0
2  71  71.0   NaN

In [14]:
#过滤掉 dropna()
df.dropna()#默认按照行过滤  内部方式为isnull().any() 有一个为True 结果就是True

    A     B     C
0  87  35.0  20.0

In [16]:
df.dropna(axis=1,how='all')#按照列过滤 内部方式为isnull().all()  全为为True 结果才是True

    A     B     C
0  87  35.0  20.0
1   0   NaN  94.0
2  71  71.0   NaN

In [19]:
df.insert(3,'D',[None]*3)
df.insert(4,'E',[None]*3)

df

    A     B     C     D     E
0  87  35.0  20.0  None  None
1   0   NaN  94.0  None  None
2  71  71.0   NaN  None  None

In [20]:
df.dropna(axis=1,how='all')

    A     B     C
0  87  35.0  20.0
1   0   NaN  94.0
2  71  71.0   NaN